Revit 2024 API
ElectricalSystem.CircuitNumber Property
 The CircuitNumber of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public string CircuitNumber { get; }
Visual Basic
Public ReadOnly Property CircuitNumber As String
	Get
Visual C++
public:
property String^ CircuitNumber {
	String^ get ();
}
Remarks
 This property is used to retrieve the CircuitNumber of the Electrical System.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace